[
    {
        "ques": "What is Sen Opulence?",
        "answer": "Sen Opulence is an affiliated website."
    },
    {
        "ques": "Why should I visit Sen Opulence if I can directly contact to its affiliated partner(s)?",
        "answer": "Our affiliated partner(s) happen to have a lot of products. Unfortunately, most of the products are of low quality. We required someone in the market to filter out the best products out of millions. Here’s when Sen Opulence comes into the picture. We have a team that spends day and night separating high-quality products from worthless ones, and to be honest, we do not compromise on the quality “NO” matter the cost."
    },
    {
        "ques": "Whom is Sen Opulence affiliated with?",
        "answer": "At Present Sen Opulence is only affiliated with amazon.com"
    },
    {
        "ques": "Is it safe to visit Sen Opulence?",
        "answer": "Yes, since Sen Opulence is just an affiliated platform. Therefore, you are actually buying products from our reliable and trustworthy affiliated partner(s) like amazon.com  "
    },
    {
        "ques": "Does Sen Opulence sell advertising on your site?",
        "answer": "At this time, we do not sell banner advertising on our site."
    },
    {
        "ques": "Does Sen Opulence own any of the products it renders?",
        "answer": "At this time, we do not own the products we are just an affiliate."
    },
    {
        "ques": "What types of products does Sen Opulence sell?",
        "answer": "Sen opulence was started just for the jewelry but now it also offers other categories as well like men’s clothes, women’s clothes, accessories, etc"
    },
    {
        "ques": "Is Sen Opulence an international website or is it confined to only certain countries?",
        "answer": "Sen Opulence operates internationally."
    },
    {
        "ques": "Is Sen Opulence an international website or is it confined to only certain countries?",
        "answer": "Sen Opulence operates internationally."
    },
    {
        "ques": "Does Sen Opulence has its own delivery?",
        "answer": "Sen Opulence does offers delivery but its status is equivalent to its affiliates partner(s)."
    }
]